r0n4n/provant_software_Ro/io-board/stm32f4/base/modules/io/c_io_imu_MPU6050.h
#define MPU6050_PWR1_DEVICE_RESET_BIT   7
#define MPU6050_PWR1_SLEEP_BIT          6
#define MPU6050_PWR1_CYCLE_BIT          5
#define MPU6050_PWR1_TEMP_DIS_BIT       3
#define MPU6050_PWR1_CLKSEL_BIT         2
#define MPU6050_PWR1_CLKSEL_LENGTH      3

#define MPU6050_CLOCK_INTERNAL          0x00
#define MPU6050_CLOCK_PLL_XGYRO         0x01
#define MPU6050_CLOCK_PLL_YGYRO         0x02
#define MPU6050_CLOCK_PLL_ZGYRO         0x03
#define MPU6050_CLOCK_PLL_EXT32K        0x04
#define MPU6050_CLOCK_PLL_EXT19M        0x05
#define MPU6050_CLOCK_KEEP_RESET        0x07

#define MPU6050_PWR2_LP_WAKE_CTRL_BIT       7
#define MPU6050_PWR2_LP_WAKE_CTRL_LENGTH    2
#define MPU6050_PWR2_STBY_XA_BIT            5
#define MPU6050_PWR2_STBY_YA_BIT            4
#define MPU6050_PWR2_STBY_ZA_BIT            3
#define MPU6050_PWR2_STBY_XG_BIT            2
#define MPU6050_PWR2_STBY_YG_BIT            1
#define MPU6050_PWR2_STBY_ZG_BIT            0

#define MPU6050_WAKE_FREQ_1P25      0x0
#define MPU6050_WAKE_FREQ_2P5       0x1
#define MPU6050_WAKE_FREQ_5         0x2
#define MPU6050_WAKE_FREQ_10        0x3

#define MPU6050_BANKSEL_PRFTCH_EN_BIT       6
#define MPU6050_BANKSEL_CFG_USER_BANK_BIT   5
#define MPU6050_BANKSEL_MEM_SEL_BIT         4
#define MPU6050_BANKSEL_MEM_SEL_LENGTH      5

#define MPU6050_WHO_AM_I_BIT        6
#define MPU6050_WHO_AM_I_LENGTH     6

#define MPU6050_DMP_MEMORY_BANKS        8
#define MPU6050_DMP_MEMORY_BANK_SIZE    256
#define MPU6050_DMP_MEMORY_CHUNK_SIZE   16

/* Exported functions ------------------------------------------------------- */

 void c_io_imu_MPU6050_int();
 bool c_io_imu_MPU6050_testConnection();

 // AUX_VDDIO register
 uint8_t c_io_imu_MPU6050_getAuxVDDIOLevel();
 void c_io_imu_MPU6050_setAuxVDDIOLevel(uint8_t level);

 // SMPLRT_DIV register
 uint8_t c_io_imu_MPU6050_getRate();
 void c_io_imu_MPU6050_setRate(uint8_t rate);

 // CONFIG register
 uint8_t c_io_imu_MPU6050_getExternalFrameSync();
 void c_io_imu_MPU6050_setExternalFrameSync(uint8_t sync);
 uint8_t c_io_imu_MPU6050_getDLPFMode();
 void c_io_imu_MPU6050_setDLPFMode(uint8_t bandwidth);

 // GYRO_CONFIG register
 uint8_t c_io_imu_MPU6050_getFullScaleGyroRange();
 void c_io_imu_MPU6050_setFullScaleGyroRange(uint8_t range);

 // ACCEL_CONFIG register
 bool c_io_imu_MPU6050_getAccelXSelfTest();
 void c_io_imu_MPU6050_setAccelXSelfTest(bool enabled);
 bool c_io_imu_MPU6050_getAccelYSelfTest();
 void c_io_imu_MPU6050_setAccelYSelfTest(bool enabled);
 bool c_io_imu_MPU6050_getAccelZSelfTest();
 void c_io_imu_MPU6050_setAccelZSelfTest(bool enabled);
 uint8_t c_io_imu_MPU6050_getFullScaleAccelRange();
 void c_io_imu_MPU6050_setFullScaleAccelRange(uint8_t range);
 uint8_t c_io_imu_MPU6050_getDHPFMode();
 void c_io_imu_MPU6050_setDHPFMode(uint8_t mode);

 // FF_THR register
 uint8_t c_io_imu_MPU6050_getFreefallDetectionThreshold();
 void c_io_imu_MPU6050_setFreefallDetectionThreshold(uint8_t threshold);

 // FF_DUR register
 uint8_t c_io_imu_MPU6050_getFreefallDetectionDuration();
 void c_io_imu_MPU6050_setFreefallDetectionDuration(uint8_t duration);

 // MOT_THR register
 uint8_t c_io_imu_MPU6050_getMotionDetectionThreshold();
 void c_io_imu_MPU6050_setMotionDetectionThreshold(uint8_t threshold);

 // MOT_DUR register
 uint8_t c_io_imu_MPU6050_getMotionDetectionDuration();
 void c_io_imu_MPU6050_setMotionDetectionDuration(uint8_t duration);

 // ZRMOT_THR register
 uint8_t c_io_imu_MPU6050_getZeroMotionDetectionThreshold();
 void c_io_imu_MPU6050_setZeroMotionDetectionThreshold(uint8_t threshold);

 // ZRMOT_DUR register
 uint8_t c_io_imu_MPU6050_getZeroMotionDetectionDuration();
 void c_io_imu_MPU6050_setZeroMotionDetectionDuration(uint8_t duration);

 // FIFO_EN register
 bool c_io_imu_MPU6050_getTempFIFOEnabled();
 void c_io_imu_MPU6050_setTempFIFOEnabled(bool enabled);
 bool c_io_imu_MPU6050_getXGyroFIFOEnabled();
 void c_io_imu_MPU6050_setXGyroFIFOEnabled(bool enabled);
 bool c_io_imu_MPU6050_getYGyroFIFOEnabled();
 void c_io_imu_MPU6050_setYGyroFIFOEnabled(bool enabled);
 bool c_io_imu_MPU6050_getZGyroFIFOEnabled();
 void c_io_imu_MPU6050_setZGyroFIFOEnabled(bool enabled);
 bool c_io_imu_MPU6050_getAccelFIFOEnabled();
 void c_io_imu_MPU6050_setAccelFIFOEnabled(bool enabled);
 bool c_io_imu_MPU6050_getSlave2FIFOEnabled();
 void c_io_imu_MPU6050_setSlave2FIFOEnabled(bool enabled);
 bool c_io_imu_MPU6050_getSlave1FIFOEnabled();
 void c_io_imu_MPU6050_setSlave1FIFOEnabled(bool enabled);
 bool c_io_imu_MPU6050_getSlave0FIFOEnabled();
 void c_io_imu_MPU6050_setSlave0FIFOEnabled(bool enabled);

 // I2C_MST_CTRL register
 bool c_io_imu_MPU6050_getMultiMasterEnabled();
 void c_io_imu_MPU6050_setMultiMasterEnabled(bool enabled);
 bool c_io_imu_MPU6050_getWaitForExternalSensorEnabled();
 void c_io_imu_MPU6050_setWaitForExternalSensorEnabled(bool enabled);
 bool c_io_imu_MPU6050_getSlave3FIFOEnabled();
 void c_io_imu_MPU6050_setSlave3FIFOEnabled(bool enabled);
 bool c_io_imu_MPU6050_getSlaveReadWriteTransitionEnabled();
 void c_io_imu_MPU6050_setSlaveReadWriteTransitionEnabled(bool enabled);
 uint8_t c_io_imu_MPU6050_getMasterClockSpeed();
 void c_io_imu_MPU6050_setMasterClockSpeed(uint8_t speed);

 // I2C_SLV* registers (Slave 0-3)
 uint8_t c_io_imu_MPU6050_getSlaveAddress(uint8_t num);
 void c_io_imu_MPU6050_setSlaveAddress(uint8_t num, uint8_t address);
 uint8_t c_io_imu_MPU6050_getSlaveRegister(uint8_t num);
 void c_io_imu_MPU6050_setSlaveRegister(uint8_t num, uint8_t reg);
 bool c_io_imu_MPU6050_getSlaveEnabled(uint8_t num);
 void c_io_imu_MPU6050_setSlaveEnabled(uint8_t num, bool enabled);
 bool c_io_imu_MPU6050_getSlaveWordByteSwap(uint8_t num);
 void c_io_imu_MPU6050_setSlaveWordByteSwap(uint8_t num, bool enabled);
 bool c_io_imu_MPU6050_getSlaveWriteMode(uint8_t num);
 void c_io_imu_MPU6050_setSlaveWriteMode(uint8_t num, bool mode);
 bool c_io_imu_MPU6050_getSlaveWordGroupOffset(uint8_t num);
 void c_io_imu_MPU6050_setSlaveWordGroupOffset(uint8_t num, bool enabled);
 uint8_t c_io_imu_MPU6050_getSlaveDataLength(uint8_t num);
 void c_io_imu_MPU6050_setSlaveDataLength(uint8_t num, uint8_t length);

 // I2C_SLV* registers (Slave 4)
 uint8_t c_io_imu_MPU6050_getSlave4Address();
 void c_io_imu_MPU6050_setSlave4Address(uint8_t address);
 uint8_t c_io_imu_MPU6050_getSlave4Register();
 void c_io_imu_MPU6050_setSlave4Register(uint8_t reg);
 void c_io_imu_MPU6050_setSlave4OutputByte(uint8_t data);
 bool c_io_imu_MPU6050_getSlave4Enabled();
 void c_io_imu_MPU6050_setSlave4Enabled(bool enabled);
 bool c_io_imu_MPU6050_getSlave4InterruptEnabled();
 void c_io_imu_MPU6050_setSlave4InterruptEnabled(bool enabled);
 bool c_io_imu_MPU6050_getSlave4WriteMode();
 void c_io_imu_MPU6050_setSlave4WriteMode(bool mode);
 uint8_t c_io_imu_MPU6050_getSlave4MasterDelay();
 void c_io_imu_MPU6050_setSlave4MasterDelay(uint8_t delay);
 uint8_t c_io_imu_MPU6050_getSlate4InputByte();

 // I2C_MST_STATUS register
 bool c_io_imu_MPU6050_getPassthroughStatus();
 bool c_io_imu_MPU6050_getSlave4IsDone();
 bool c_io_imu_MPU6050_getLostArbitration();
 bool c_io_imu_MPU6050_getSlave4Nack();
 bool c_io_imu_MPU6050_getSlave3Nack();
 bool c_io_imu_MPU6050_getSlave2Nack();
 bool c_io_imu_MPU6050_getSlave1Nack();
 bool c_io_imu_MPU6050_getSlave0Nack();

 // INT_PIN_CFG register
 bool c_io_imu_MPU6050_getInterruptMode();
 void c_io_imu_MPU6050_setInterruptMode(bool mode);
 bool c_io_imu_MPU6050_getInterruptDrive();
 void c_io_imu_MPU6050_setInterruptDrive(bool drive);
 bool c_io_imu_MPU6050_getInterruptLatch();
 void c_io_imu_MPU6050_setInterruptLatch(bool latch);
 bool c_io_imu_MPU6050_getInterruptLatchClear();
 void c_io_imu_MPU6050_setInterruptLatchClear(bool clear);
 bool c_io_imu_MPU6050_getFSyncInterruptLevel();
 void c_io_imu_MPU6050_setFSyncInterruptLevel(bool level);
 bool c_io_imu_MPU6050_getFSyncInterruptEnabled();
 void c_io_imu_MPU6050_setFSyncInterruptEnabled(bool enabled);
 bool c_io_imu_MPU6050_getI2CBypassEnabled();
 void c_io_imu_MPU6050_setI2CBypassEnabled(bool enabled);
 bool c_io_imu_MPU6050_getClockOutputEnabled();
 void c_io_imu_MPU6050_setClockOutputEnabled(bool enabled);

 // INT_ENABLE register
 uint8_t c_io_imu_MPU6050_getIntEnabled();
 void c_io_imu_MPU6050_setIntEnabled(uint8_t enabled);
 bool c_io_imu_MPU6050_getIntFreefallEnabled();
 void c_io_imu_MPU6050_setIntFreefallEnabled(bool enabled);
 bool c_io_imu_MPU6050_getIntMotionEnabled();
 void c_io_imu_MPU6050_setIntMotionEnabled(bool enabled);
 bool c_io_imu_MPU6050_getIntZeroMotionEnabled();
 void c_io_imu_MPU6050_setIntZeroMotionEnabled(bool enabled);
 bool c_io_imu_MPU6050_getIntFIFOBufferOverflowEnabled();
 void c_io_imu_MPU6050_setIntFIFOBufferOverflowEnabled(bool enabled);
 bool c_io_imu_MPU6050_getIntI2CMasterEnabled();
 void c_io_imu_MPU6050_setIntI2CMasterEnabled(bool enabled);
 bool c_io_imu_MPU6050_getIntDataReadyEnabled();
 void c_io_imu_MPU6050_setIntDataReadyEnabled(bool enabled);

 // INT_STATUS register
 uint8_t c_io_imu_MPU6050_getIntStatus();
 bool c_io_imu_MPU6050_getIntFreefallStatus();
 bool c_io_imu_MPU6050_getIntMotionStatus();
 bool c_io_imu_MPU6050_getIntZeroMotionStatus();
 bool c_io_imu_MPU6050_getIntFIFOBufferOverflowStatus();
 bool c_io_imu_MPU6050_getIntI2CMasterStatus();
 bool c_io_imu_MPU6050_getIntDataReadyStatus();

 // ACCEL_*OUT_* registers
 void c_io_imu_MPU6050_getMotion9(int16_t* ax, int16_t* ay, int16_t* az, int16_t* gx, int16_t* gy, int16_t* gz, int16_t* mx, int16_t* my, int16_t* mz);
 void c_io_imu_MPU6050_getMotion6(int16_t* ax, int16_t* ay, int16_t* az, int16_t* gx, int16_t* gy, int16_t* gz);
 void c_io_imu_MPU6050_getAcceleration(int16_t* x, int16_t* y, int16_t* z);
 int16_t c_io_imu_MPU6050_getAccelerationX();
 int16_t c_io_imu_MPU6050_getAccelerationY();
 int16_t c_io_imu_MPU6050_getAccelerationZ();

 // TEMP_OUT_* registers
 int16_t c_io_imu_MPU6050_getTemperature();

 // GYRO_*OUT_* registers
 void c_io_imu_MPU6050_getRotation(int16_t* x, int16_t* y, int16_t* z);
 int16_t c_io_imu_MPU6050_getRotationX();
 int16_t c_io_imu_MPU6050_getRotationY();
 int16_t c_io_imu_MPU6050_getRotationZ();

 // EXT_SENS_DATA_* registers
 uint8_t c_io_imu_MPU6050_getExternalSensorByte(int position);
 uint16_t c_io_imu_MPU6050_getExternalSensorWord(int position);
 uint32_t c_io_imu_MPU6050_getExternalSensorDWord(int position);

 // MOT_DETECT_STATUS register
 bool c_io_imu_MPU6050_getXNegMotionDetected();
 bool c_io_imu_MPU6050_getXPosMotionDetected();
 bool c_io_imu_MPU6050_getYNegMotionDetected();
 bool c_io_imu_MPU6050_getYPosMotionDetected();
 bool c_io_imu_MPU6050_getZNegMotionDetected();
 bool c_io_imu_MPU6050_getZPosMotionDetected();
 bool c_io_imu_MPU6050_getZeroMotionDetected();

