r0n4n/provant_software_Ro/io-board/stm32f4/base/modules/io/c_io_imu_MPU6050.h
 // I2C_SLV*_DO register
 void c_io_imu_MPU6050_setSlaveOutputByte(uint8_t num, uint8_t data);

 // I2C_MST_DELAY_CTRL register
 bool c_io_imu_MPU6050_getExternalShadowDelayEnabled();
 void c_io_imu_MPU6050_setExternalShadowDelayEnabled(bool enabled);
 bool c_io_imu_MPU6050_getSlaveDelayEnabled(uint8_t num);
 void c_io_imu_MPU6050_setSlaveDelayEnabled(uint8_t num, bool enabled);

 // SIGNAL_PATH_RESET register
 void c_io_imu_MPU6050_resetGyroscopePath();
 void c_io_imu_MPU6050_resetAccelerometerPath();
 void c_io_imu_MPU6050_resetTemperaturePath();

 // MOT_DETECT_CTRL register
 uint8_t c_io_imu_MPU6050_getAccelerometerPowerOnDelay();
 void c_io_imu_MPU6050_setAccelerometerPowerOnDelay(uint8_t delay);
 uint8_t c_io_imu_MPU6050_getFreefallDetectionCounterDecrement();
 void c_io_imu_MPU6050_setFreefallDetectionCounterDecrement(uint8_t decrement);
 uint8_t c_io_imu_MPU6050_getMotionDetectionCounterDecrement();
 void c_io_imu_MPU6050_setMotionDetectionCounterDecrement(uint8_t decrement);

 // USER_CTRL register
 bool c_io_imu_MPU6050_getFIFOEnabled();
 void c_io_imu_MPU6050_setFIFOEnabled(bool enabled);
 bool c_io_imu_MPU6050_getI2CMasterModeEnabled();
 void c_io_imu_MPU6050_setI2CMasterModeEnabled(bool enabled);
 void c_io_imu_MPU6050_switchSPIEnabled(bool enabled);
 void c_io_imu_MPU6050_resetFIFO();
 void c_io_imu_MPU6050_resetI2CMaster();
 void c_io_imu_MPU6050_resetSensors();

 // PWR_MGMT_1 register
 void c_io_imu_MPU6050_reset();
 bool c_io_imu_MPU6050_getSleepEnabled();
 void c_io_imu_MPU6050_setSleepEnabled(bool enabled);
 bool c_io_imu_MPU6050_getWakeCycleEnabled();
 void c_io_imu_MPU6050_setWakeCycleEnabled(bool enabled);
 bool c_io_imu_MPU6050_getTempSensorEnabled();
 void c_io_imu_MPU6050_setTempSensorEnabled(bool enabled);
 uint8_t c_io_imu_MPU6050_getClockSource();
 void c_io_imu_MPU6050_setClockSource(uint8_t source);

 // PWR_MGMT_2 register
 uint8_t c_io_imu_MPU6050_getWakeFrequency();
 void c_io_imu_MPU6050_setWakeFrequency(uint8_t frequency);
 bool c_io_imu_MPU6050_getStandbyXAccelEnabled();
 void c_io_imu_MPU6050_setStandbyXAccelEnabled(bool enabled);
 bool c_io_imu_MPU6050_getStandbyYAccelEnabled();
 void c_io_imu_MPU6050_setStandbyYAccelEnabled(bool enabled);
 bool c_io_imu_MPU6050_getStandbyZAccelEnabled();
 void c_io_imu_MPU6050_setStandbyZAccelEnabled(bool enabled);
 bool c_io_imu_MPU6050_getStandbyXGyroEnabled();
 void c_io_imu_MPU6050_setStandbyXGyroEnabled(bool enabled);
 bool c_io_imu_MPU6050_getStandbyYGyroEnabled();
 void c_io_imu_MPU6050_setStandbyYGyroEnabled(bool enabled);
 bool c_io_imu_MPU6050_getStandbyZGyroEnabled();
 void c_io_imu_MPU6050_setStandbyZGyroEnabled(bool enabled);

 // FIFO_COUNT_* registers
 uint16_t c_io_imu_MPU6050_getFIFOCount();

 // FIFO_R_W register
 uint8_t c_io_imu_MPU6050_getFIFOByte();
 void c_io_imu_MPU6050_setFIFOByte(uint8_t data);
 void c_io_imu_MPU6050_getFIFOBytes(uint8_t *data, uint8_t length);

 // WHO_AM_I register
 uint8_t c_io_imu_MPU6050_getDeviceID();
 void c_io_imu_MPU6050_setDeviceID(uint8_t id);

#ifdef __cplusplus
}
#endif

#endif //C_IO_IMU_MPU6050_H
